{
  "pregxxy.book.patterns.spells.pregxxy.name": "Breedxxy Patterns",
  "pregxxy.book.patterns.spells.pregxxy.breed.details.1": "Puts the target in breeding mood. Mishaps if used on a creature which can't breed. Costs about one $(l:items/amethyst)$(item)Amethyst Shard/$.",
  "pregxxy.book.patterns.spells.pregxxy.breed.details.2": "A subtle but rudimentary manipulation of minds, only animals are simple enough to be receptive. The animalistic nature of this spell means that allays are, to my disappointment, unaffected. Their mind is far too pure.",
  "pregxxy.book.patterns.spells.nurture.name": "Nurture",
  "pregxxy.book.patterns.spells.nurture.details.1": "Instantly ages the target for the given amount of time. The unit of time is one twentieth of a second by my count.",
  "pregxxy.book.patterns.spells.nurture.details.2": "There are several peculiarities with this spell. It appears to be able to reverse aging in a way: it is able to shorten the time between production of offsprings for mature targets. However, care must be taken, as too much regressing will quite literally revert the subject into a child.$(p)Its exact cost is in dusts (x/2)^2 + x + 2, x being units of time skipped divided by 100.",
  "pregxxy.book.patterns.spells.super_pregxxy.name": "Greater Breed",
  "pregxxy.book.patterns.spells.super_pregxxy.details.1": "Instantly kills the target, splitting its matter and media to form two children. Creatures without any form of offspring will crystallize into media instead. Inanimate entities cause the spell to mishap.",
  "pregxxy.book.patterns.spells.super_pregxxy.details.2": "Costs one $(l:items/amethyst)$(item)Amethyst Shard/$ per point of health on the target. Allays, being pure media, requires more thought to separate, equal to 15 amethyst shards. Crystallization yields two $(l:items/amethyst)$(item)Amethyst Dust/$ per point of health.$(p)Hostile creatures will shrug off the attempt unless on the brink of death. $(p)The dragon's single-minded task of protection means that its death may yield offsprings as well.",
  "pregxxy.book.patterns.spells.get_age.name": "Cron's Purification",
  "pregxxy.book.patterns.spells.get_age.details.1": "Returns the age of the target in ticks. Negative values indicate time to adulthood while positive indicates breeding cooldown.$(p)Produces garbage if the target has no age.",

  hexcasting: {
    action: {
      "pregxxy:": {
        pregxxy : "Breed",
        greater_pregxxy: "Greater Breed",
        nurture: "Nurture",
        get_age: "Cron's Purification"
      },

      // use this to add shortened versions of pattern names if the full name won't fit in the ingame book
      // you don't need to add an entry for every pattern - the above value will be used as a default
      book: {
        "pregxxy:": {
          pregxxy: "Breed",
        },
      },
    },
    mishap: {
      cantBreed: "needs a valid progenitor but got %s",
      cantBreedStrong: "needs a suitably weak-willed creature but got %s",
      cantNurture: "needs a child but got %s",
    },
  },

  text: {
    pregxxy: {
      pregxxy: "Breed the target entity!",
    },
  },
}
